goodhoods/app/controllers/main_controller.rb

  def map
    @found_user = User.find session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]

  def about
    @found_user = User.find session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]