goodhoods/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["username", "dude"]]
---
  def attempt_login
  if params[:username].present? && params[:password].present?
       @found_user = User.where(username: params[:username]).first

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def home
    user_id = session[:user_id]
    @found_user = User.find(user_id)

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new user_params

    if @user.save